---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRunType.TreadNosingPosition
source: html/e5f0486c-4ca8-72fd-35cc-d8a0c9a77a7c.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunType.TreadNosingPosition Property

Represents on which edges of the nosing to apply the nosing profile.

## Syntax (C#)
```csharp
public TreadNosingPosition TreadNosingPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The run type has no tread so the data being set is not applicable.